let handler = m => m; 

 handler.all = async function (m) { 
 let chat = global.db.data.chats[m.chat]; 
 let responses; 
 if (/^كت$/i.test(m.text)) { 
 responses = [ 
 `*∞──────「كـت」──────∞*

*~『لوفي』~*

*∞──────「كـت」──────∞*`,  
 `*∞──────「كـت」──────∞*

*~『ناروتو』~*

*∞──────「كـت」──────∞*`,  
 `*∞──────「كـت」──────∞*

*~『سابو』~*

*∞──────「كـت」──────∞*`,  
 `*∞──────「كـت」──────∞*

*~『ايس』~*

*∞──────「كـت」──────∞*`,  
 `*∞──────「كـت」──────∞*

*~『رايلي』~*

*∞──────「كـت」──────∞*`,  
 `*∞──────「كـت」──────∞*

*~『جيرايا』~*

*∞──────「كـت」──────∞*`,  
 `*∞──────「كـت」──────∞*

*~『ايتاتشي』~*

*∞──────「كـت」──────∞*`,
 `*∞──────「كـت」──────∞*
